

&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	Материал = Элементы.Материалы.ТекущиеДанные.Материал;  	Элементы.Материалы.ТекущиеДанные.ЕдИзм = получед(Материал).ЕдИзм;
	Элементы.Материалы.ТекущиеДанные.Стоимость = получед(Материал).Себестоимость;      	
КонецПроцедуры     

функция получед(материал)  Запрос = Новый Запрос;  Запрос.Текст =     "ВЫБРАТЬ ПЕРВЫЕ 1    |  Материалы.Ссылка КАК Ссылка,    |  Материалы.ЕдИзм КАК ЕдИзм, 
	|  Материалы.ЗакупочнаяСтоимость КАК ЗакСтоимость    |ИЗ    |  Справочник.Материалы КАК Материалы    |ГДЕ    |  Материалы.Ссылка = &Ссылка";  Запрос.УстановитьПараметр("Ссылка",материал);    РезультатЗапроса = Запрос.Выполнить();    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
  
  Вернуть = Новый Структура;    Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	  Вернуть.Вставить("ЕдИзм", ВыборкаДетальныеЗаписи.ЕдИзм); 
	  Вернуть.Вставить("Себестоимость", ВыборкаДетальныеЗаписи.ЗакСтоимость);  	Возврат Вернуть;  Иначе     Возврат Неопределено;  КонецЕсли;конецФункции

&НаКлиенте
Процедура МатериалыНормаРасходаПриИзменении(Элемент)
	ТекСтрока = Элементы.Материалы.ТекущиеДанные;
	Если ТекСтрока.НормаРасхода <> 0 Тогда
		ТекСтрока.Сумма = ТекСтрока.НормаРасхода * ТекСтрока.Стоимость;
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры 

Функция ОбновитьСебестоимостьУслуги()  
	Часы = Объект.НормаВремениНаВыполнение;
	ОкладВЧасСотрудника = Объект.ОтвественныйЗаВыполнение.Должность.Оклад;   
	СуммаМатериалов = 0;
	Для каждого стр Из Объект.Материалы Цикл  
		Если стр.Сумма <> Неопределено Тогда
			СуммаМатериалов = СуммаМатериалов + стр.Сумма;
		КонецЕсли;
	КонецЦикла;
	Себестоимость = Часы * ОкладВЧасСотрудника + СуммаМатериалов;    
	Если Себестоимость <> Неопределено ИЛИ Себестоимость <> 0 Тогда
		Возврат Себестоимость;  
	Иначе
		Возврат 0;  
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура НормаВремениНаВыполнениеПриИзменении(Элемент)
	Себестоимость = ОбновитьСебестоимостьУслуги(); 
	Объект.Себестоимость = Себестоимость;   
	Объект.МинимальнаяСтоимостьДляПартнера = Себестоимость + Себестоимость / 100 * 15;
КонецПроцедуры


&НаКлиенте
Процедура ОтвественныйЗаВыполнениеПриИзменении(Элемент)
	Себестоимость = ОбновитьСебестоимостьУслуги(); 
	Объект.Себестоимость = Себестоимость;   
	Объект.МинимальнаяСтоимостьДляПартнера = Себестоимость + Себестоимость / 100 * 15;
КонецПроцедуры


&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	Себестоимость = ОбновитьСебестоимостьУслуги(); 
	Объект.Себестоимость = Себестоимость;   
	Объект.МинимальнаяСтоимостьДляПартнера = Себестоимость + Себестоимость / 100 * 15;
КонецПроцедуры

