
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
КонецПроцедуры

&НаСервере
Функция ПартнерПриИзмененииНаСервере(ПартнерСсылка)
	ОбъектПартнер = ПартнерСсылка.ПолучитьОбъект();
	Возврат ОбъектПартнер.ФизическийАдрес;
	// Вставить содержимое обработчика.
КонецФункции

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ПартнерСсылка = Объект.Партнер;
	Объект.Адрес = ПартнерПриИзмененииНаСервере(ПартнерСсылка);
КонецПроцедуры

&НаСервере
Процедура УслугиУслугаПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	Услуга = Элементы.Услуги.ТекущиеДанные.Услуга;
	Элементы.Услуги.ТекущиеДанные.Себестоимость = ПолучитьСебестоимостьУслуги(Услуга);
	УслугиУслугаПриИзмененииНаСервере();
КонецПроцедуры 

Функция ПолучитьСебестоимостьУслуги(Услуга)
  Запрос = Новый Запрос;
  Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |  Услуги.Ссылка КАК Ссылка, 
	|  Услуги.Себестоимость КАК Себестоимость
    |ИЗ
    |  Справочник.Услуги КАК Услуги
    |ГДЕ
    |  Материалы.Ссылка = &Ссылка";
  Запрос.УстановитьПараметр("Ссылка",Услуга);
  
  РезультатЗапроса = Запрос.Выполнить();
  
  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
    
  Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	  Возврат ВыборкаДетальныеЗаписи.Себестоимость;    
  Иначе
	Возврат Неопределено;
  КонецЕсли;
КонецФункции


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Завершен Тогда 
		МенеджерЗаписи = РегистрыСведений.ОказанныеУслуги.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ДокументОказанныхУслуг = Объект.Ссылка;
		МенеджерЗаписи.ДатаОформления = Объект.ДатаОформления;
		МенеджерЗаписи.ДатаОказания = Объект.ДатаОказания;
		МенеджерЗаписи.Партнер = Объект.Партнер;
		МенеджерЗаписи.СуммаУслуг = Объект.СуммаУслуг;
		МенеджерЗаписи.ИтогоКОплате = Объект.ИтогКОплате; 
		МенеджерЗаписи.Записать();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	Если ТекСтрока.Количество <> 0 Тогда
		ТекСтрока.ИтогПоУслуге = ТекСтрока.Количество * ТекСтрока.Себестоимость;
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры  

Процедура ОбновитьСуммуУслуг() 
	СуммаУслуг = 0;
	Для каждого стр Из Объект.Услуги Цикл  
		Если стр.ИтогПоУслуге <> Неопределено Тогда
			СуммаУслуг = СуммаУслуг + стр.ИтогПоУслуге;
		КонецЕсли;
	КонецЦикла;  
	Объект.СуммаУслуг = СуммаУслуг;
КонецПроцедуры


&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	ОбновитьСуммуУслуг();
	ОбновитьИтогИПредоплату();
КонецПроцедуры  

Процедура ОбновитьИтогИПредоплату() 
	Объект.ИтогКОплате = Объект.СуммаУслуг + Объект.СуммаУслуг / 100 * Объект.Наценка - Объект.СуммаУслуг / 100 * Объект.Скидка;
	Объект.СуммаПредоплаты = Объект.ИтогКОплате / 100 * 50;
КонецПроцедуры

&НаКлиенте
Процедура СуммаУслугПриИзменении(Элемент)
	ОбновитьИтогИПредоплату();
КонецПроцедуры

&НаКлиенте
Процедура НаценкаПриИзменении(Элемент)
	ОбновитьИтогИПредоплату();
КонецПроцедуры

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	ОбновитьИтогИПредоплату();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	Если Объект.ПроверкаТехнолога = Ложь И Объект.СтатусЗаявки <> "ОжидаетПредоплаты" Тогда
		ПредупреждениеАсинх("Невозможно без согласования отвественного технолога вывести заказа из статуса Ожидает предоплату, отмена проведения",, "Ошибка проверки технологом");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	КонецПроцедуры


